# Pandas Data Frames
## 1. Creating a Pandas DataFrame
A DataFrame is a two-dimensional, labeled data structure in Pandas.
It is similar to an Excel spreadsheet or SQL table.

In [35]:
import numpy as np
import pandas as pd

In [95]:
from numpy.random import randn
np.random.seed(101)

In [97]:
# Creating 
df_rnd=pd.DataFrame(data=randn(5,4),index=['A','B','C','D','E'],columns=['W','X','Y','Z'])

In [99]:
df_rnd

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Creating a DataFrame from a dictionary
We create dataframe using a dictionary with scalar (single) values and a dictionary of lists.

In [ ]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'Salary': [50000, 60000, 70000, 80000]
}
df = pd.DataFrame(data)

In [72]:
my_dict={"Name":"Sam","Age":40,"Salary":10000}

In [74]:
df=pd.DataFrame(data=my_dict,index=[0])

In [76]:
df

  Name  Age  Salary
0  Sam   40   10000

In [78]:
my_dict={'Name':['Beryl','Kath','Sam','Mandy'],
        'Age':[25,30,40,23],
        'Salary':[10000,20000,35000,12000],}

In [80]:
df=pd.DataFrame(data=my_dict)

In [82]:
df

    Name  Age  Salary
0  Beryl   25   10000
1   Kath   30   20000
2    Sam   40   35000
3  Mandy   23   12000

In [84]:
# Display the DataFrame

display(df)

    Name  Age  Salary
0  Beryl   25   10000
1   Kath   30   20000
2    Sam   40   35000
3  Mandy   23   12000

##  Accessing Data
You can access specific columns, rows, or values in a DataFrame.

In [117]:
# Access a single column
df_rnd['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [121]:
display(df['Name'])

0    Beryl
1     Kath
2      Sam
3    Mandy
Name: Name, dtype: object

In [108]:
type(df_rnd['W'])

pandas.core.series.Series

In [110]:
type(df)

pandas.core.frame.DataFrame

In [123]:
# Access multiple columns
display(df[['Name', 'Salary']])

    Name  Salary
0  Beryl   10000
1   Kath   20000
2    Sam   35000
3  Mandy   12000

In [129]:

# Access a specific row by index
display(df.iloc[1])

Name       Kath
Age          30
Salary    20000
Name: 1, dtype: object

## 4. Accessing Columns - Best Practices
When accessing a single column in a DataFrame, you might see both of these notations:

### 1️ Using dot notation (not recommended)
```
df.W
```
While this works, it is not the best practice because:
- It can cause confusion with built-in methods of Pandas DataFrames.
- If a column name conflicts with an existing method, unexpected behavior may occur.

### 2️ Using bracket notation (recommended)
```
df['W']
```
This is the preferred way because:
- It avoids conflicts with DataFrame methods.
- It is more explicit and readable.

For multiple columns, always use double brackets:
```
df[['W', 'X']]
```
This ensures a DataFrame is returned instead of a Series.

In [112]:
df_rnd.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

However with this method Python may gets confused, cause there are a bunch of methods available after `df.` the best way is to use `[]` notation when requesting a column name

In [135]:
df_rnd[['W', 'X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

## selecting Rows

In [141]:
# Locational labeled base insed
df_rnd.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [147]:
# Based off of index position
df_rnd.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [149]:
# Selecting subset of rows and columns
df_rnd.loc['B','Y']

-0.8480769834036315

In [153]:
df_rnd.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

## Filtering Data

Filtering is used to select specific rows based on conditions.

In [157]:
# Select rows where Age is greater than 30
filtered_df = df[df['Age'] > 30]
display(filtered_df)

  Name  Age  Salary
2  Sam   40   35000

In [159]:
df_rnd>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [161]:
booldf=df_rnd>0

In [163]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [167]:
df_rnd[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [169]:
df_rnd['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [173]:
df_rnd

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Since we're passing a Boolean Series (`df_rnd['W'] > 0`), Pandas keeps only the rows where the condition evaluates to `True`. The resulting DataFrame excludes rows where `W` has negative or zero values.

In [179]:
# Filtering rows where column 'W' > 0
df_rnd[df_rnd['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [176]:
# All the data in dataframe, where Z is less 
df_rnd[df_rnd['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

`df_rnd['W'] > 0` creates a Boolean Series, which returns True for rows where column `'W'` is greater than 0 and False otherwise.

`df_rnd[df_rnd['W'] > 0]` filters the DataFrame to include only rows where `'W' > 0`.

`['Y']` selects only the column `'Y'` from the filtered DataFrame, returning a Pandas Series.

In [181]:
df_rnd[df_rnd['W']>0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

## Selecting Multiple Columns
The filtering step `df_rnd[df_rnd['W'] > 0]` remains the same (only rows where `'W' > 0` are kept).

`[['Y', 'X']]` selects both columns `'Y'` and `'X'`, returning a DataFrame instead of a Series.

In [185]:
df_rnd[df_rnd['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [197]:
df_rnd[(df_rnd['W']>0) & (df_rnd['Y'] > 1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

## Handling Missing Values
Missing values in a DataFrame can be filled or removed.

In [191]:
 # Creating a DataFrame with missing values
data_with_nan = {
    'Name': ['Alice', 'Bob', None, 'David'],
    'Age': [25, None, 35, 40],
    'Salary': [50000, 60000, 70000, None]
}
df_nan = pd.DataFrame(data_with_nan)
display(df_nan)

    Name   Age   Salary
0  Alice  25.0  50000.0
1    Bob   NaN  60000.0
2   None  35.0  70000.0
3  David  40.0      NaN

## Fill missing values

In [194]:
df_nan_filled = df_nan.fillna({'Name': 'Unknown', 'Age': df_nan['Age'].mean(), 'Salary': df_nan['Salary'].median()})
display(df_nan_filled)

      Name        Age   Salary
0    Alice  25.000000  50000.0
1      Bob  33.333333  60000.0
2  Unknown  35.000000  70000.0
3    David  40.000000  60000.0